Revit 2026 API

# TileTileRandomSeed Property

---

The property labeled "Randomize" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TileRandomSeed { get; }
```
```vb
Public Shared ReadOnly Property TileRandomSeed As String
	Get
```
```cpp
public:
static property String^ TileRandomSeed {
	String^ get ();
}
```
```fsharp
static member TileRandomSeed : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with a minimum of "0".

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace